In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
gb1 = df.groupby(by = 'Pclass')
gb1

In [7]:
gb1.sum()

        PassengerId  Survived      Age  SibSp  Parch        Fare
Pclass
1             99705       136  7111.42     90     77  18177.4125
2             82056        87  5168.83     74     70   3801.8417
3            215625       119  8924.92    302    193   6714.6951

In [8]:
gb1['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [11]:
gb1[['Age', 'Fare']].mean()

              Age       Fare
Pclass
1       38.233441  84.154687
2       29.877630  20.662183
3       25.140620  13.675550

In [14]:
df.groupby('Pclass')['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [15]:
df.groupby('Pclass')[['Age']].mean()

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

In [29]:
df.groupby('Pclass')[['Age', 'Fare']].mean()

              Age       Fare
Pclass
1       38.233441  84.154687
2       29.877630  20.662183
3       25.140620  13.675550

In [30]:
df.groupby('Sex')[['Survived']].mean()

        Survived
Sex
female  0.742038
male    0.188908

In [36]:
df[(df['Sex'] == 'female') & df['Survived'] == 1].shape

(233, 12)

In [38]:
df.groupby('Pclass')[['Survived']].mean()

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [40]:
df.groupby(['Sex','Pclass'])[['Survived']].mean()

               Survived
Sex    Pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

In [41]:
df.groupby('Pclass').aggregate(['max', 'mean', 'sum', 'count', 'median'])

       PassengerId                                  Survived                 \
               max        mean     sum count median      max      mean  sum
Pclass
1              890  461.597222   99705   216  472.0        1  0.629630  136
2              887  445.956522   82056   184  435.5        1  0.472826   87
3              891  439.154786  215625   491  432.0        1  0.242363  119

                     ... Parch                                  Fare  \
       count median  ...   max      mean  sum count median       max
Pclass               ...
1        216    1.0  ...     4  0.356481   77   216    0.0  512.3292
2        184    0.0  ...     3  0.380435   70   184    0.0   73.5000
3        491    0.0  ...     6  0.393075  193   491    0.0   69.5500


             mean         sum count   median
Pclass
1       84.154687  18177.4125   216  60.2875
2       20.662183   3801.8417   184  14.2500
3       13.675550   6714.6951   491   8.0500

[3 rows x 30 columns]